UKS/src/Tasks/ЗадачиПользователю/ЗадачиПользователю.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Task>
  <name>ЗадачиПользователю</name>
  <addressing>InformationRegister.РегистрАдресации</addressing>
  <attributes>
    <name>Описание</name>
    <comment>Описание</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокВыполнения</name>
    <comment>Срок выполнения</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеЗадачи</name>
    <comment>Состояние задачи</comment>
    <type>
      <types>EnumRef.СостоянияЗадачи</types>
    </type>
  </attributes>
  <addressingAttributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </addressingAttributes>
  <addressingAttributes>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </addressingAttributes>
</mdclass:Task>

UKS/src/Enums/СостоянияЗадачи/СостоянияЗадачи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияЗадачи</name>
  <comment>Состояния задачи</comment>
  <enumValues>
    <name>Новая</name>
    <comment>Новая</comment>
  </enumValues>
  <enumValues>
    <name>ВРаботе</name>
    <comment>В работе</comment>
  </enumValues>
  <enumValues>
    <name>Отложена</name>
    <comment>Отложена</comment>
  </enumValues>
  <enumValues>
    <name>Готова</name>
    <comment>Готова</comment>
  </enumValues>
</mdclass:Enum>

UKS/src/Tasks/ЗадачиПользователю/Forms/ФормаСписка/Module.bsl
&НаСервереБезКонтекста
Процедура ОбновитьСтатусЗадач(МассивЗадач, НовыйСтатус)
	
	Для Каждого ТекущаяЗадача Из МассивЗадач Цикл
		
		ЗадачаОбъект = ТекущаяЗадача.ПолучитьОбъект();
		Если ЗадачаОбъект.СостояниеЗадачи=НовыйСтатус Тогда
			Продолжить;
		КонецЕсли;
		
		ЗадачаОбъект.СостояниеЗадачи = НовыйСтатус;
		
		Если НовыйСтатус = Перечисления.СостоянияЗадачи.Готова Тогда
			ЗадачаОбъект.Выполнена = Истина;
		КонецЕсли;
		
		Попытка
			ЗадачаОбъект.Записать();
		Исключение
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "Не удалось изменить статус задачи" + ТекущаяЗадача + " по причине: "+ОписаниеОшибки();
			Сообщение.Сообщить();
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСтатусыЗадачКлиент(МассивЗадач,Статус)
	
	Если ТипЗнч(МассивЗадач)=Тип("Массив") Тогда
		ОбновитьСтатусЗадач(МассивЗадач, Статус);
	КонецЕсли;
	
	ОповеститьОбИзменении(Тип("ЗадачаСсылка.ЗадачиПользователю"));
	
КонецПроцедуры

&НаКлиенте
Процедура СписокНоваяПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	МассивЗадач = ПараметрыПеретаскивания.Значение;
	ОбновитьСтатусыЗадачКлиент(МассивЗадач, ПредопределенноеЗначение("Перечисление.СостоянияЗадачи.Новая"));
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВРаботеПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	МассивЗадач = ПараметрыПеретаскивания.Значение;
	ОбновитьСтатусыЗадачКлиент(МассивЗадач, ПредопределенноеЗначение("Перечисление.СостоянияЗадачи.ВРаботе"));
	
КонецПроцедуры

&НаКлиенте
Процедура СписокОтложенаПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	МассивЗадач = ПараметрыПеретаскивания.Значение;
	ОбновитьСтатусыЗадачКлиент(МассивЗадач, ПредопределенноеЗначение("Перечисление.СостоянияЗадачи.Отложена"));
	
КонецПроцедуры

&НаКлиенте
Процедура СписокГотоваПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	МассивЗадач = ПараметрыПеретаскивания.Значение;
	ОбновитьСтатусыЗадачКлиент(МассивЗадач, ПредопределенноеЗначение("Перечисление.СостоянияЗадачи.Готова"));
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьВсеЗадачи(Команда)
	
	ОткрытьФорму("Задача.ЗадачиПользователю.Форма.ФормаСпискаВсеЗадачи");
	
КонецПроцедуры

&НаКлиенте
Процедура СписокНоваяНачалоПеретаскивания(Элемент, ПараметрыПеретаскивания, Выполнение)
	// Вставить содержимое обработчика.
КонецПроцедуры
